In [1]:
import pandas as pd

In [4]:
df = pd.read_csv(r"C:\Users\nuke2\Desktop\NW Work\Spring Work\MSiA-SQ\Data\MSiA 431\02_hw\google_2gram_sample.csv", header=None, sep="\t")

In [5]:
x = 567
df.iloc[x:x+4, :]

                 0       1    2    3
567   69 vertebral  1947.0  2.0    2
568      69-80_X .  1945.0  9.0    9
569  69.2 16.7_NUM  1961.0  1.0    1
570            690     NaN  NaN  NaN

In [8]:
df.sort_values(by=[1], ascending=True)

                       0       1    2    3
64661          663_. ._.  1524.0  1.0    1
62316              640 .  1564.0  1.0    1
84609         6_NUM that  1568.0  2.0    1
11290         62_NUM (_.  1600.0  3.0    1
8805    6 contracts_NOUN  1600.0  2.0    1
...                  ...     ...  ...  ...
116207         68Ga_NOUN     NaN  NaN  NaN
116217               690     NaN  NaN  NaN
116219           691_NUM     NaN  NaN  NaN
116241               6:9     NaN  NaN  NaN
116259             6hown     NaN  NaN  NaN

[116265 rows x 4 columns]